Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_lptim16.h
  /**
   * @brief    Get Counter Update Event Interrupt Enable Status
   * @rmtoll   IER    OVIE    FL_LPTIM16_IsEnabledIT_Update
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledIT_Update(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->IER, LPTIM16_IER_OVIE_Msk) == LPTIM16_IER_OVIE_Msk);
  }

  /**
   * @brief    Get External Trigger Interrupt Enable Status
   * @rmtoll   IER    TRIGIE    FL_LPTIM16_IsEnabledIT_Trigger
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledIT_Trigger(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->IER, LPTIM16_IER_TRIGIE_Msk) == LPTIM16_IER_TRIGIE_Msk);
  }

  /**
   * @brief    Get Channel Capture Overflow Interrupt Enable Status
   * @rmtoll   IER    OVRIE    FL_LPTIM16_IsEnabledIT_CCOverflow
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledIT_CCOverflow(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->IER, ((channel & 0x3) << 0x8U)) == ((channel & 0x3) << 0x8U));
  }

  /**
   * @brief    Get Quaderate Decoder Direction Changed Interrupt Enable Status
   * @rmtoll   IER    QDCIE    FL_LPTIM16_IsEnabledIT_EncoderChangeDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledIT_EncoderChangeDir(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->IER, LPTIM16_IER_QDCIE_Msk) == LPTIM16_IER_QDCIE_Msk);
  }

  /**
   * @brief    Get Capture/Compare Channel Interrupt Flag
   * @rmtoll   ISR    CCIF    FL_LPTIM16_IsActiveFlag_CC
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsActiveFlag_CC(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, ((channel & 0x3) << 0x0U)) == ((channel & 0x3) << 0x0U));
  }

  /**
   * @brief    Get Update Event Interrupt Flag
   * @rmtoll   ISR    OVIF    FL_LPTIM16_IsActiveFlag_Update
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsActiveFlag_Update(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, LPTIM16_ISR_OVIF_Msk) == (LPTIM16_ISR_OVIF_Msk));
  }

  /**
   * @brief    Get External Trigger Interrupt Flag
   * @rmtoll   ISR    TRIGIF    FL_LPTIM16_IsActiveFlag_Trigger
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsActiveFlag_Trigger(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, LPTIM16_ISR_TRIGIF_Msk) == (LPTIM16_ISR_TRIGIF_Msk));
  }

  /**
   * @brief    Get Channel Capture Overflow Interrupt Flag
   * @rmtoll   ISR    OVRIF    FL_LPTIM16_IsActiveFlag_CCOverflow
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsActiveFlag_CCOverflow(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, ((channel & 0x3) << 0x8U)) == ((channel & 0x3) << 0x8U));
  }

  /**
   * @brief    Get Quaderate Decoder Direction Changed Interrupt Flag
   * @rmtoll   ISR    QDCIF    FL_LPTIM16_IsActiveFlag_EncoderChangeDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsActiveFlag_EncoderChangeDir(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, LPTIM16_ISR_QDCIF_Msk) == (LPTIM16_ISR_QDCIF_Msk));
  }

  /**
   * @brief    Clear Capture/Compare Channel Interrupt Flag
   * @rmtoll   ISR    CCIF    FL_LPTIM16_ClearFlag_CC
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_ClearFlag_CC(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    WRITE_REG(LPTIM16x->ISR, ((channel & 0x3) << 0x0U));
  }

  /**
   * @brief    Clear Update Event Interrupt Flag
   * @rmtoll   ISR    OVIF    FL_LPTIM16_ClearFlag_Update
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_ClearFlag_Update(LPTIM16_Type *LPTIM16x)
  {
    WRITE_REG(LPTIM16x->ISR, LPTIM16_ISR_OVIF_Msk);
  }

  /**
   * @brief    Clear External Trigger Interrupt Flag
   * @rmtoll   ISR    TRIGIF    FL_LPTIM16_ClearFlag_Trigger
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_ClearFlag_Trigger(LPTIM16_Type *LPTIM16x)
  {
    WRITE_REG(LPTIM16x->ISR, LPTIM16_ISR_TRIGIF_Msk);
  }

  /**
   * @brief    Clear Channel Capture Overflow Interrupt Flag
   * @rmtoll   ISR    OVRIF    FL_LPTIM16_ClearFlag_CCOverflow
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_ClearFlag_CCOverflow(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    WRITE_REG(LPTIM16x->ISR, ((channel & 0x3) << 0x8U));
  }

  /**
   * @brief    Clear Quaderate Decoder Direction Changed Interrupt Flag
   * @rmtoll   ISR    QDCIF    FL_LPTIM16_ClearFlag_EncoderChangeDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_ClearFlag_EncoderChangeDir(LPTIM16_Type *LPTIM16x)
  {
    WRITE_REG(LPTIM16x->ISR, LPTIM16_ISR_QDCIF_Msk);
  }

  /**
   * @brief    Set Auto Reload Value
   * @rmtoll   ARR        FL_LPTIM16_WriteAutoReload
   * @param    LPTIM16x LPTIM16 instance
   * @param    autoReload
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_WriteAutoReload(LPTIM16_Type *LPTIM16x, uint32_t autoReload)
  {
    MODIFY_REG(LPTIM16x->ARR, (0xffffU << 0U), (autoReload << 0U));
  }

  /**
   * @brief    Get Auto Reload Value
   * @rmtoll   ARR        FL_LPTIM16_ReadAutoReload
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadAutoReload(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ARR, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @brief    Set Input Capture Channel Capture Edge
   * @rmtoll   CCSR    CAPCFG    FL_LPTIM16_IC_SetCaptureEdge
   * @param    LPTIM16x LPTIM16 instance
   * @param    polarity This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC_EDGE_RISING
   *           @arg @ref FL_LPTIM16_IC_EDGE_FALLING
   *           @arg @ref FL_LPTIM16_IC_EDGE_BOTH
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_IC_SetCaptureEdge(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      MODIFY_REG(LPTIM16x->CCSR, (0x3U << 8U), (polarity << 0U));
      break;
    case FL_LPTIM16_CHANNEL_2:
      MODIFY_REG(LPTIM16x->CCSR, (0x3U << 10U), (polarity << 2U));
      break;
    }
  }

  /**
   * @brief    Get Input Capture Channel Capture Edge
   * @rmtoll   CCSR    CAPCFG    FL_LPTIM16_IC_GetCaptureEdge
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC_EDGE_RISING
   *           @arg @ref FL_LPTIM16_IC_EDGE_FALLING
   *           @arg @ref FL_LPTIM16_IC_EDGE_BOTH
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IC_GetCaptureEdge(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 8U)) >> 0U);
    case FL_LPTIM16_CHANNEL_2:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 10U)) >> 2U);
    default:
      return 0;
    }
  }

  /**
   * @brief    Set Channel Output Compare Polarity
   * @rmtoll   CCSR    CCP    FL_LPTIM16_OC_SetPolarity
   * @param    LPTIM16x LPTIM16 instance
   * @param    polarity This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_OC_POLARITY_NORMAL
   *           @arg @ref FL_LPTIM16_OC_POLARITY_INVERT
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_OC_SetPolarity(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      MODIFY_REG(LPTIM16x->CCSR, (0x1U << 16U), (polarity << 0U));
      break;
    case FL_LPTIM16_CHANNEL_2:
      MODIFY_REG(LPTIM16x->CCSR, (0x1U << 17U), (polarity << 1U));
      break;
    }
  }

  /**
   * @brief    Get Channel Output Compare Polarity
   * @rmtoll   CCSR    CCP    FL_LPTIM16_OC_GetPolarity
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_OC_POLARITY_NORMAL
   *           @arg @ref FL_LPTIM16_OC_POLARITY_INVERT
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_OC_GetPolarity(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 16U)) >> 0U);
    case FL_LPTIM16_CHANNEL_2:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 17U)) >> 1U);
    default:
      return 0;
    }
  }

  /**
   * @brief    Set Input Capture Channel Input Polarity
   * @rmtoll   CCSR    CCP    FL_LPTIM16_IC_SetInputPolarity
   * @param    LPTIM16x LPTIM16 instance
   * @param    polarity This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC_POLARITY_NORMAL
   *           @arg @ref FL_LPTIM16_IC_POLARITY_INVERT
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_IC_SetInputPolarity(LPTIM16_Type *LPTIM16x, uint32_t polarity, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      MODIFY_REG(LPTIM16x->CCSR, (0x1U << 16U), (polarity << 0U));
      break;
    case FL_LPTIM16_CHANNEL_2:
      MODIFY_REG(LPTIM16x->CCSR, (0x1U << 17U), (polarity << 1U));
      break;
    }
  }

  /**
   * @brief    Get Input Capture Channel Input Polarity
   * @rmtoll   CCSR    CCP    FL_LPTIM16_IC_GetInputPolarity
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC_POLARITY_NORMAL
   *           @arg @ref FL_LPTIM16_IC_POLARITY_INVERT
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IC_GetInputPolarity(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 16U)) >> 0U);
    case FL_LPTIM16_CHANNEL_2:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 17U)) >> 1U);
    default:
      return 0;
    }
  }

  /**
   * @brief    Enable Channel Input Digital Filter
   * @rmtoll   CCSR        FL_LPTIM16_EnableDigitalFilter
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_EnableDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    SET_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU));
  }

  /**
   * @brief    Disable Channel Input Digital Filter
   * @rmtoll   CCSR        FL_LPTIM16_DisableDigitalFilter
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_DisableDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    CLEAR_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU));
  }

  /**
   * @brief    Get Channel Input Digital Filter Enable Status
   * @rmtoll   CCSR        FL_LPTIM16_IsEnabledDigitalFilter
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   State of bit (1 or 0).
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IsEnabledDigitalFilter(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, ((channel & 0x3) << 0xcU)) == ((channel & 0x3) << 0xcU));
  }

  /**
   * @brief    Set Channel 1 Input Prescaler
   * @rmtoll   CCSR    CAP1PSC    FL_LPTIM16_IC_WriteChannel1Prescaler
   * @param    LPTIM16x LPTIM16 instance
   * @param    psc
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_IC_WriteChannel1Prescaler(LPTIM16_Type *LPTIM16x, uint32_t psc)
  {
    MODIFY_REG(LPTIM16x->CCSR, (0x3fU << 26U), (psc << 26U));
  }

  /**
   * @brief    Get Channel 1 Input Prescaler Setting
   * @rmtoll   CCSR    CAP1PSC    FL_LPTIM16_IC_ReadChannel1Prescaler
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IC_ReadChannel1Prescaler(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3fU << 26U)) >> 26U);
  }

  /**
   * @brief    Set Channel Operation Mode
   * @rmtoll   CCSR    CCS    FL_LPTIM16_SetChannelMode
   * @param    LPTIM16x LPTIM16 instance
   * @param    mode This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_DISABLE
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_INPUT
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_OUTPUT
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_SetChannelMode(LPTIM16_Type *LPTIM16x, uint32_t mode, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      MODIFY_REG(LPTIM16x->CCSR, (0x3U << 0U), (mode << 0U));
      break;
    case FL_LPTIM16_CHANNEL_2:
      MODIFY_REG(LPTIM16x->CCSR, (0x3U << 2U), (mode << 2U));
      break;
    }
  }

  /**
   * @brief    Get Channel Operation Mode
   * @rmtoll   CCSR    CCS    FL_LPTIM16_GetChannelMode
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_DISABLE
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_INPUT
   *           @arg @ref FL_LPTIM16_CHANNEL_MODE_OUTPUT
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetChannelMode(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 0U)) >> 0U);
    case FL_LPTIM16_CHANNEL_2:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x3U << 2U)) >> 2U);
    default:
      return 0;
    }
  }

  /**
   * @brief    Get Channel Captured Edge
   * @rmtoll   CCSR    CAPEDGE    FL_LPTIM16_IC_GetCapturedEdge
   * @param    LPTIM16x LPTIM16 instance
   * @param    channel This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_CHANNEL_1
   *           @arg @ref FL_LPTIM16_CHANNEL_2
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC_CAPCTURED_EDGE_FALLING
   *           @arg @ref FL_LPTIM16_IC_CAPCTURED_EDGE_RISING
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IC_GetCapturedEdge(LPTIM16_Type *LPTIM16x, uint32_t channel)
  {
    switch (channel)
    {
    case FL_LPTIM16_CHANNEL_1:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 20U)) >> 0U);
    case FL_LPTIM16_CHANNEL_2:
      return (uint32_t)(READ_BIT(LPTIM16x->CCSR, (0x1U << 21U)) >> 1U);
    default:
      return 0;
    }
  }

  /**
   * @brief    Get Quadrature Decoder Direction
   * @rmtoll   ISR    QDIR    FL_LPTIM16_GetEncoderDir
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_ENCODER_DIR_CH1_BEFORE_CH2
   *           @arg @ref FL_LPTIM16_ENCODER_DIR_CH1_BEHIND_CH2
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_GetEncoderDir(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->ISR, LPTIM16_ISR_QDIR_Msk));
  }

  /**
   * @brief    Set Channel 1 Capture Source
   * @rmtoll   CCSR    CAP1SSEL    FL_LPTIM16_IC_SetChannel1CaptureSource
   * @param    LPTIM16x LPTIM16 instance
   * @param    source This parameter can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_CHANNEL1
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_XTLF
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_RCLP
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_RCLF
   * @retval   None
   */
  __STATIC_INLINE void FL_LPTIM16_IC_SetChannel1CaptureSource(LPTIM16_Type *LPTIM16x, uint32_t source)
  {
    MODIFY_REG(LPTIM16x->CCSR, LPTIM16_CCSR_CAP1SSEL_Msk, source);
  }

  /**
   * @brief    Get Channel 1 Capture Source Setting
   * @rmtoll   CCSR    CAP1SSEL    FL_LPTIM16_IC_GetChannel1CaptureSource
   * @param    LPTIM16x LPTIM16 instance
   * @retval   Returned value can be one of the following values:
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_CHANNEL1
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_XTLF
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_RCLP
   *           @arg @ref FL_LPTIM16_IC1_CAPTURE_SOURCE_RCLF
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_IC_GetChannel1CaptureSource(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CCSR, LPTIM16_CCSR_CAP1SSEL_Msk));
  }

  /**
   * @brief    Read LPTIM16 Counter Value
   * @rmtoll   CNT        FL_LPTIM16_ReadCounter
   * @param    LPTIM16x LPTIM16 instance
   * @retval
   */
  __STATIC_INLINE uint32_t FL_LPTIM16_ReadCounter(LPTIM16_Type *LPTIM16x)
  {
    return (uint32_t)(READ_BIT(LPTIM16x->CNT, (0xffffU << 0U)) >> 0U);
  }

  /**
   * @}
   */

  /** @defgroup LPTIM16_FL_EF_Init Initialization and de-initialization functions
   * @{
   */
  FL_ErrorStatus FL_LPTIM16_DeInit(LPTIM16_Type *LPTIM16x);
  FL_ErrorStatus FL_LPTIM16_Init(LPTIM16_Type *LPTIM16x, FL_LPTIM16_InitTypeDef *init);
  void FL_LPTIM16_StructInit(FL_LPTIM16_InitTypeDef *init);
  FL_ErrorStatus FL_LPTIM16_IC_Init(LPTIM16_Type *LPTIM16x, uint32_t channel, FL_LPTIM16_IC_InitTypeDef *ic_init);
  void FL_LPTIM16_IC_StructInit(FL_LPTIM16_IC_InitTypeDef *ic_init);
  FL_ErrorStatus FL_LPTIM16_OC_Init(LPTIM16_Type *LPTIM16x, uint32_t channel, FL_LPTIM16_OC_InitTypeDef *oc_init);
  void FL_LPTIM16_OC_StructInit(FL_LPTIM16_OC_InitTypeDef *oc_init);

  /**
   * @}
   */

  /**
   * @}
   */

  /**
   * @}
   */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_LPTIM16_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-23*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
